In [1]:
import pandas as pd
import numpy as np

In [2]:
school_data = pd.read_csv('Resources/schools_complete.csv')
student_data = pd.read_csv('Resources/students_complete.csv')

In [3]:
school_df = pd.merge(student_data,school_data,how ='left',on='school_name')

In [4]:
school_df.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635

In [5]:
#total no of schools
school_total = school_df.school_name.value_counts().count()

In [6]:
#total no of students
student_total = school_df["Student ID"].count()

In [7]:
school_df.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635

In [8]:
# total budget
total_budget= school_data.budget.sum().astype(str)
total_budget = '$' + total_budget

In [9]:
#Average math score
avg_math = school_df.math_score.mean()

In [10]:
#Average reading score
avg_read= school_df.reading_score.mean()

In [11]:
#overall passing rate
overall_pass = (school_df.math_score.mean() + school_df.reading_score.mean())/2

In [12]:
# percentage of student with passing math score 70 or greater
new_df = (school_df.loc[school_df.math_score >=70])
per_math=new_df.student_name.count()/school_df.student_name.count()*100

In [13]:
# percentage of student with passing math score 70 or greater
new_df = (school_df.loc[school_df.reading_score >=70])
per_reading=new_df.student_name.count()/school_df.student_name.count()*100

In [14]:
district_df =pd.DataFrame(columns =['Total\n Schools','Total\nStudents','Total Budget','Average\nMath\nScore','Average\nReading\nScore','%\nPassing\nMath','%\nPassing\nReading','%\nOverall\Passing'],data=[[school_total,student_total,total_budget,avg_math,avg_read,per_math,per_reading,overall_pass]])

pd.options.display.float_format = '{:,.6f}'.format
district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall\Passing
0,15,39170,$24649428,78.985371,81.877840,74.980853,85.805463,80.431606

In [15]:
new_df = school_df.groupby('school_name')
new_df.student_name.count()

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: student_name, dtype: int64

In [16]:
new_df.budget.sum()

school_name
Bailey High School       15549641728
Cabrera High School       2009159448
Figueroa High School      5557128039
Ford High School          4831365924
Griffin High School       1346890000
Hernandez High School    14007062700
Holden High School         105933149
Huang High School         5573322295
Johnson High School      14733628650
Pena High School           563595396
Rodriguez High School    10186904637
Shelton High School       1860672600
Thomas High School        1705517550
Wilson High School        3012587442
Wright High School        1888920000
Name: budget, dtype: int64